Revit 2027 API
Rebar.IsBarHidden Method
 Identifies if a given bar in this rebar set is hidden in this view.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsBarHidden(
	View view,
	int barIndex
)
Public Function IsBarHidden (
	view As View,
	barIndex As Integer
) As Boolean
public:
bool IsBarHidden(
	View^ view,
	int barIndex
)
member IsBarHidden :
        view : View *
        barIndex : int -> bool
Parameters
view View
 The view.
barIndex Int32
 The index of the bar from this rebar set.
Return Value
Boolean
 True if the bar is hidden in this view, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  barIndex should be in range [ 0, NumberOfBarPositions-1 ] and the bar at barIndex should be included.
See Also
Reference
Rebar Class
Autodesk.Revit.DB.Structure Namespace